#โปรแกรมแสดงข้อความต้อนรับนักศึกษา โดยรับชื่อ และชั้นปีทางแป้นพิมพ์แล้วแสดงข้อความต้อนรับ ดังนี้ กรณีป้อนชั้นปี 1 แสดงข้อความ "Welcome Freshman" กรณีป้อนชั้นปี 2 แสดงข้อความ "Welcome Sophomore" กรณีป้อนชั้นปี 3 แสดงข้อความ "Welcome Junior" กรณีป้อนชั้นปี 4 แสดงข้อความ "Welcome Senior" กรณีป้อน ปีอื่นๆ  แสดงข้อความ "Oh, no ...."
print('--------------------------------------------')
print('       โปรแกรมแสดงข้อความต้อนรับนักศึกษา')
print('--------------------------------------------')

A = input('โปรดป้อนชื่อ: ')
C = input('โปรดป้อนชั้นปี (1-4): ')
print('--------------------------------------------')
if C == '1' :
    print(f'Welcome Freshman คุณ {A}')
elif C == '2' :
    print(f'Welcome Sophomore คุณ {A}')
elif C == '3' :
    print(f'Welcome Junior คุณ {A}')
elif C == '4' :
    print(f'Welcome Senior คุณ {A}')
else :
    print('Oh, no ....')
print('--------------------------------------------')