#โปรแกรมตรวจสอบน้ำหนักรถบรรทุก ว่ารถบรรทุกนั้นมีน้ำหนักรถผ่านเกณฑ์หรือไม่ หากน้ำหนักเกิน 1000 ให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถไม่ผ่านเกณฑ์"  แต่หากน้ำหนักตั้งแต่ 1000 ลงมาให้แสดงข้อความว่า "รถทะเบียน ???? น้ำหนักรถผ่านเกณฑ์" โดยให้ป้อนทะเบียนรถบรรทุก และน้ำหนักรถบรรทุกทางแป้นพิมพ์

print('--------------------------------------------')
print('          โปรแกรมตรวจสอบน้ำหนักรถบรรทุก')
print('--------------------------------------------')

y = input('กรุณาป้อนทะเบียนรถ: ')
z = float(input('กรุณาป้อนน้ำหนักรถบรรทุก: '))
print('--------------------------------------------')
if z > 1000 :
    print(f'รถทะเบียน {y} น้ำหนักรถไม่ผ่านเกณฑ์')
else :
    print(f'รถทะเบียน {y} น้ำหนักรถผ่านเกณฑ์')
print('ขอบคุณที่ใช้บริการ UwU')