# สร้างโปรแกรมคำนวณผลคูณของตัวเลข 2 จำนวนที่รับทางแป้นพิมพ์ แล้วแสดงผลทางหน้าจอ ทั้งนี้โปรแกรมจะทำการคำนวณผลคูณจากตัวเลขที่รับทางแป้นพิมพ์ไปเรื่อยๆ จนกว่าผลคูณจะมากกว่า 5000 ถึงจะหยุดการทำงาน

print('----------------------------')
print(' โปรแกรมคำนวณผลคูณ')
print('----------------------------')

while True :
    A = int(input('ป้อนเลขตัวที่หนึ่ง: '))
    B = int(input('ป้อนเลขตัวที่สอง: '))
    print(f'ผลคูณของ {A} และ {B} เท่ากับ {A * B}')
    if A * B > 5000 :
        break
    print('----------------------------')
print('----------------------------')
 