#โปรแกรมซึ่งรับชื่อ และปีเกิดของผู้ใช้โปรแกรมทางแป้นพิมพ์ โดยหากอายุที่ผู้ใช้ป้อนมีค่าตั้งแต่ 35 ปีขึ้นไป ให้แสดงข้อความว่า "คุณแก่แล้ว..." หากไม่ถึงให้แสดงข้อความ "คุณยังไม่แก่..." ทางหน้าจอ

from datetime import datetime

print('--------------------------------------------')
print('             โปรแกรมตรวจสอบวัยวุฒิ')
print('--------------------------------------------')

x = input('กรุณาป้อนชื่อ: ')
y = int(input('กรุณาป้อนปีเกิด พ.ศ. : '))
y = (datetime.now().year + 543)-y

print('--------------------------------------------')

if y > 35 :
    print(f'คุณ {x} อายุ {y} คุณแก่แล้ว!')
else :
    print(f'คุณ {x} อายุ {y} สบายใจได้คุณยังไม่แก่!')