#โปรแกรมคำนวณราคาสินค้าที่รับส่วนลดแล้ว โดยป้อนรหัสสินค้า ชื่อสินค้า ประเภทสินค้า ซึ่งมี 4 ประเภท คือ food(F/f), woman(W/w), man(M/m), kitchen(K/k) โดยป้อนเป็นตัวย่อ  และราคาสินค้าทางแป้นพิมพ์ แล้วคำนวณราคาสินค้าที่รับส่วนลดแล้วทางหน้าจอ โดยสินค้าประเภท food ลด 2% ของราคาสินค้า, woman ลด 4% ของราคาสินค้า, man ลด 6% ของราคาสินค้า, kitchen ลด 10% ของราคาสินค้า หากป้อนประเภทสินค้าผิดจากที่กำหนดให้แสดงข้อความ "คุณป้อนประเภทผิด !!!"

print('--------------------------------------------')
print('           โปรแกรม Product sale')
print('--------------------------------------------')
A = input('ป้อนรหัสสินค้า: ')
B = input('ป้อนชื่อสินค้า: ')
C = input('ป้อนประเภทสินค้า (F/f, W/w, M/m, K/k): ')
D = float(input('ป้อนราคาสินค้า: '))
print('--------------------------------------------')
if C == 'F' or c== 'f' :
    E = D - (D * 2/100)
    print(f'ราคาสินค้าที่ลดแล้วเป็น {E} บาท')
elif C == 'W' or c == 'w' :
    E = D - (D * 4/100)
    print(f'ราคาสินค้าที่ลดแล้วเป็น {E} บาท')
elif C == 'M' or c == 'm' :
    E = D - (D * 6/100)
    print(f'ราคาสินค้าที่ลดแล้วเป็น {E} บาท')
elif C == 'K' or c == 'K' :
    E = D - (D * 10/100)
    print(f'ราคาสินค้าที่ลดแล้วเป็น {E} บาท')
else :
    print('คุณป้อนประเภทสินค้าผิด !!! โปรดป้อนใหม่อีกครั้ง')
print('--------------------------------------------')