# โปรแกรมตรวจสอบรถว่าผ่านเกณฑ์ของการตรวจสอบค่าคาร์บอนไดซ์ออกไซน์หรือ โดยหากค่าคาร์บอนไดซ์ออกไซน์มีค่าเกินกว่า 678.55 ให้แสดงข้อความว่า “ไม่ผ่าน”  หากน้อยกว่า 678.55 ให้แสดงข้อความ “ผ่าน” โดยให้รับชื่อเจ้าของ ทะเบียนรถ และปริมาณก๊าซคาร์บอนไดซ์ออกไซน์ที่วัดได้ ทางแป้นพิมพ์

print('--------------------------------------------')
print('            ตรวจสอบสภาพรถ')
print('--------------------------------------------')
x = input('กรุณาป้อนชือ ')
y = input('กรุณาป้อนทะเบียนรถ ')
z = float(input('กรุณาป้อนก๊าซคาร์บอนไดซ์ออกไซน์ '))
print('--------------------------------------------')
if z > 678.55 :
    print(f'รถทะเบียน {y} ของคุณ {x} ไม่ผ่านเกณฑ์')
else :
    print(f'รถทะเบียน {y} ของคุณ {x} ผ่านเกณฑ์')
print('ขอบคุณที่ใช้บริการ UwU')